import {Container, List, Text} from "./styled";
import {Question} from "./Question/Question";

const questions = [
    {
        question: 'What is the question?',
        answers: ['Мы создали пространство, в котором каждый ребёнок проявляет и раскрывает себя, развивает индивидуальные особенности и таланты.\n' +
        'Мы создали пространство, в котором каждый ребёнок проявляет и раскрывает себя, развивает индивидуальные особенности и таланты.\n' +
        'Мы создали пространство, в котором каждый ребёнок проявляет и раскрывает себя, развивает индивидуальные особенности и таланты.\n' +
        'Мы создали пространство, в котором каждый ребёнок проявляет и раскрывает себя, развивает индивидуальные особенности и таланты.\n',
            'Мы создали пространство, в котором каждый ребёнок проявляет и раскрывает себя, развивает индивидуальные особенности и таланты.\n' +
            'Мы создали пространство, в котором каждый ребёнок проявляет и раскрывает себя, развивает индивидуальные особенности и таланты.\n' +
            'Мы создали пространство, в котором каждый ребёнок проявляет и раскрывает себя, развивает индивидуальные особенности и таланты.\n' +
            'Мы создали пространство, в котором каждый ребёнок проявляет и раскрывает себя, развивает индивидуальные особенности и таланты.\n'],
    },
    {
        question: 'What is the question?',
        answers: ['answer']
    },
    {
        question: 'What is the question?',
        answers: ['answer']
    }
]
export const Questions =()=>{
    return (
        <Container>
            <List>
                {questions.map((question, index) => (
                    <Question title={question.question} key={index} >
                        {question.answers.map((answer, index) => (
                            <Text key={index}>
                                {answer}
                            </Text>
                        ))}
                    </Question>
                ))}
            </List>
        </Container>
    )
}